; domain
(define
	(domain farmer)
	(:requirements :adl)
	(:types obiekt brzeg)
	(:constants east west - brzeg)
	(:predicates
		(na-brzegu ?x - brzeg ?a - obiekt)
		(aktualny-brzeg ?x - brzeg)
		(nie-lubi ?a ?b - obiekt)
	)
	(:action przewiez
		:parameters (?a - obiekt ?x ?y - brzeg)
		:precondition
		(and
			(na-brzegu ?x ?a)
			(aktualny-brzeg ?x)
			(not (exists (?o ?oo - obiekt)
				(and
					(na-brzegu ?x ?o)
					(na-brzegu ?x ?oo)
					(nie-lubi ?o ?oo)
					(not (= ?o ?oo))
					(not (= ?o ?a))
					(not (= ?oo ?a))
				 ))
			)
			(not (= ?x ?y))	
		)
		:effect
		(and
			(not(na-brzegu ?x ?a))
			(na-brzegu ?y ?a)
			(not(aktualny-brzeg ?x))
			(aktualny-brzeg ?y)
		)
	)
	(:action przeplyn_sam
		:parameters (?x ?y - brzeg)
		:precondition
		(and 
			(aktualny-brzeg ?x)
			(not (= ?x ?y))
			(not (exists (?o ?oo - obiekt)
				(and
					(na-brzegu ?x ?o)
					(na-brzegu ?x ?oo)
					(nie-lubi ?o ?oo)
					(not (= ?o ?oo))
				 ))
			)
		)
		:effect
		(and
			(not (aktualny-brzeg ?x))
			(aktualny-brzeg ?y)
		)
	)
)

; problem
(define (problem p1)
(:domain farmer)
(:objects wilk owca kapusta - obiekt)
(:init
	(na-brzegu west wilk)
	(na-brzegu west owca)
	(na-brzegu west kapusta)
	(aktualny-brzeg west)
	(nie-lubi wilk owca)
	(nie-lubi owca wilk)
	(nie-lubi kapusta owca)
	(nie-lubi owca kapusta)
)
(:goal 
	(and
		(na-brzegu east wilk)
		(na-brzegu east owca)
		(na-brzegu east kapusta)
	)
)
)

; plan
1. (przewiez owca west east)
   deleted: (na-brzegu west owca) (aktualny-brzeg west)
   added: (na-brzegu east owca) (aktualny-brzeg east)
   goals met: 1 of 3
2. (przeplyn_sam east west)
   deleted: (aktualny-brzeg east)
   added: (aktualny-brzeg west)
   goals met: 1 of 3
3. (przewiez kapusta west east)
   deleted: (na-brzegu west kapusta) (aktualny-brzeg west)
   added: (na-brzegu east kapusta) (aktualny-brzeg east)
   goals met: 2 of 3
4. (przewiez owca east west)
   deleted: (na-brzegu east owca) (aktualny-brzeg east)
   added: (na-brzegu west owca) (aktualny-brzeg west)
   goals met: 1 of 3
5. (przewiez wilk west east)
   deleted: (na-brzegu west wilk) (aktualny-brzeg west)
   added: (na-brzegu east wilk) (aktualny-brzeg east)
   goals met: 2 of 3
6. (przeplyn_sam east west)
   deleted: (aktualny-brzeg east)
   added: (aktualny-brzeg west)
   goals met: 2 of 3
7. (przewiez owca west east)
   deleted: (na-brzegu west owca) (aktualny-brzeg west)
   added: (na-brzegu east owca) (aktualny-brzeg east)
   goals met: 3 of 3
